
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Дата2 = КонецГода(ТекущаяДата());
	Отчет.Дата1 = НачалоГода(ДобавитьМесяц(Отчет.Дата2, -3*12));
	
	Отчет.Периодичность = Перечисления.Периодичность.Год;
	Отчет.СтандартОтчетности = Справочники.СтандартыОтчетности.МСФО;
	
	Отчет.КолвоПериодовДляОсмотраНазад = 3;
	Отчет.ФлагИспользоватьВыделениеЦветом = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = Отчет.Дата1;
	Период.ДатаОкончания = Отчет.Дата2;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Отчет.Дата1 = Период.ДатаНачала;
	Отчет.Дата2 = Период.ДатаОкончания;
	
КонецПроцедуры
