&НаСервере
Процедура УстановитьОбразецЦветаНаСервере()
	
	Элементы.Образец.ЦветФона = Справочники.Цвета.ПолучитьЦветИзСтроки(Объект.ЦветСтрокой);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуЦвета(Цвет)
	
	Возврат Справочники.Цвета.ПолучитьСтрокуИзЦвета(Цвет);
	
КонецФункции


&НаКлиенте
Процедура ОбразецНажатие(Элемент)
	
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДиалогВыбораЦвета.Цвет = Элементы.Образец.ЦветФона;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбораЦветаЗавершение", ЭтаФорма);
	ДиалогВыбораЦвета.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбораЦветаЗавершение(ВыбранныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЦвет <> Неопределено Тогда
		Объект.ЦветСтрокой = ПолучитьСтрокуЦвета(ВыбранныйЦвет);
	КонецЕсли; 
	
	УстановитьОбразецЦветаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОбразецЦветаНаСервере();
	
КонецПроцедуры
